const GenerationData = {
  maleNames: [
    "Мохаммад", "Али", "Амир", "Реза", "Хоссейн", "Мехди", "Хасан", "Саид", "Алиреза", "Омид",
    "Фархад", "Маджид", "Пежман", "Сина", "Эхсан", "Шахин", "Камран", "Навид", "Амин", "Хамид",
    "Джавад", "Мостафа", "Киан", "Арья", "Мазиар", "Касра", "Саман", "Бехзад", "Мансур", "Фарзад",
    "Дариуш", "Курош", "Мехран", "Парвиз", "Бабак", "Шахром", "Махмуд", "Иман", "Амирхоссейн", "Маджид"
  ],
  femaleNames: [
    "Фатеме", "Захра", "Марьям", "Сара", "Нилуфар", "Ширин", "Махса", "Лейла", "Азаде", "Неда",
    "Роя", "Самира", "Насим", "Парвин", "Саназ", "Таране", "Ясмин", "Арезу", "Мина", "Назанин",
    "Сепиде", "Афсане", "Мона", "Шива", "Махтаб", "Париса", "Эльназ", "Роксана", "Фарназ", "Гольназ",
    "Атефе", "Сахар", "Бахар", "Шади", "Малаке", "Гети", "Зохре", "Лайа", "Можде", "Негар"
  ],
  surnames: [
    "Мохаммади", "Хоссейни", "Ахмади", "Резаи", "Мусави", "Джафари", "Хашеми", "Карими", "Рахими", "Эслами",
    "Садегхи", "Надери", "Ростами", "Фарахманд", "Ширази", "Техрани", "Пахлаван", "Азизи", "Гользар", "Дариуш",
    "Алипур", "Моради", "Амири", "Фархади", "Бахтиари", "Наджафи", "Сафари", "Тахери", "Заре", "Салехи",
    "Хейдари", "Эбрахими", "Аббаси", "Ходадади", "Махмуди", "Шарифи", "Ализаде", "Аслани", "Касеми", "Рад"
  ],
  placesOfBirth: [
    "Тегеран", "Мешхед", "Исфахан", "Тебриз", "Шираз", "Ахваз", "Кум", "Керманшах", "Урмия", "Рашт",
    "Захедан", "Хамадан", "Керман", "Йезд", "Ардебиль", "Бендер-Аббас", "Арак", "Зенджан", "Санандадж", "Казвин",
    "Хорремабад", "Горгань", "Сари", "Шахре-Корд", "Бушир", "Илам", "Бирдженд", "Семнан", "Ясудж", "Заболь"
  ],
  religions: [
    "Ислам (Шиизм)", "Ислам (Суннизм)", "Зороастризм", "Христианство (Армянская церковь)", "Христианство (Ассирийская церковь)", "Иудаизм", "Бахаизм", "Атеизм"
  ],
  positiveTraits: [
    "Прагматичность", "Адаптивность", "Лояльность", "Исполнительность", "Симпатия к Западу", "Наблюдательность", 
    "Ответственность", "Честность", "Обучаемость", "Готовность к сотрудничеству", "Антирадикализм", "Стрессоустойчивость", 
    "Верность слову", "Инициативность", "Уважение к силе", "Смелость", "Рассудительность", "Осторожность", 
    "Техническая грамотность", "Хорошая память", "Коммуникабельность", "Неприхотливость", "Знание местности"
  ],
  negativeTraits: [
    "Фанатичность", "Скрытность", "Двуличие", "Подозрительная осведомленность", "Ненависть к иностранцам", 
    "Излишняя набожность", "Меркантильность", "Склонность к манипуляциям", "Агрессивность", "Жестокость", 
    "Патриотизм (проправительственный)", "Непредсказуемость", "Жадность", "Лживость", "Трусость", "Мстительность", 
    "Высокомерие", "Излишнее любопытство", "Паникерство", "Связи с криминалом", "Импульсивность", "Недисциплинированность"
  ],
  positiveRecords: [
    "Владеет разговорным английским языком", "В прошлом имел легальный бизнес с иностранными компаниями", 
    "Проходил срочную службу в регулярной армии (Артеш), уволен в запас", "Имеет родственников-эмигрантов в США или Европе", 
    "Участвовал в студенческих антиправительственных протестах", "Предоставил достоверные данные о тайнике с оружием", 
    "Тайно помогал западным журналистам до конфликта", "Уволен с госслужбы за неблагонадежность", 
    "Имеет навыки радиоперехвата и связи", "Хорошо ориентируется в системе подземных коммуникаций города", 
    "Спас бойца коалиции во время перестрелки на рынке", "Отказался вступать в ряды ополчения 'Басидж'",
    "Работал переводчиком в иностранной гуманитарной миссии", "Обладает медицинскими навыками, готов лечить раненых",
    "Предупредил патруль о готовящейся засаде"
  ],
  negativeRecords: [
    "Часто посещает мечети, известные своими радикальными проповедниками", "Регулярно выезжает в приграничные районы без ясной причины", 
    "Замечен в контактах с подозрительными вооруженными группировками", "Имеет необъяснимый и постоянный источник дохода", 
    "Обладает отличной военной подготовкой неясного происхождения", "Слишком навязчиво предлагает свои услуги в качестве информатора", 
    "Пойман с поддельными документами на блокпосту", "Ранее работал на заводе, связанном с оборонной промышленностью", 
    "При обыске дома найдена литература экстремистского толка", "Был задержан с незарегистрированной портативной радиостанцией", 
    "Родственники занимают высокие посты в государственном аппарате", "Пойман на откровенной лжи при стандартном опросе",
    "Замечен за скрытым фотографированием военной базы", "Имеет татуировки, характерные для радикальных группировок",
    "В прошлом подозревался в контрабанде оружия через границу"
  ]
};
